test/fixture/paos/Transmit2.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Header>
      <sb:Correlation xmlns:sb="http://urn:liberty:sb:2003-08" messageID="Id469" refToMessageID="5dd8f951-9be6-4b2f-8f70-a8cc5e7e4327"/>
   </soap:Header>
   <soap:Body>
   <Transmit xmlns="urn:iso:std:iso-iec:24727:tech:schema">
<SlotHandle>33393236303635313532</SlotHandle>
<InputAPDUInfo>
<InputAPDU>0CA4020C1D871101A59030685388957D6E2B5275AC82BB198E08870AED7F394826C000</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CB0000000000E970200008E080388A41FBC277C680000</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CA4020C1D8711013EFE77256902B3E2F1715FCA7EEF223A8E08A02C5F476D8E237700</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CB0000000000E970200008E080AD2AA74759240CE0000</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CA4020C1D8711014975FAC0882F0BF4C1E1C5CED555B1F58E08D11E50AA47C7CACC00</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CB0000000000E970200008E08F98D94F3906A49170000</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CA4020C1D871101C29B19471B3E36927EC6DA64AEF864CD8E08247F32860E4568A600</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CB0000000000E970200008E08C5C819FB6A0D695E0000</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CA4020C1D8711018F820CDBAD555652034E626FB37F86138E08CD3315A36561145000</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CB0000000000E970200008E08DA60F404B079B0420000</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CA4020C1D8711018540F01B03C3E973C5777D9BB1F04E9E8E08286A94789231A2FC00</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CB0000000000E970200008E086A0FDF4AD3FC272B0000</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CA4020C1D87110195BCF8D7ACEA42AD4683947DBE73BE078E0810B17C642A9001BC00</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CB0000000000E970200008E08DE56082154DF14190000</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CA4020C1D871101C2C66976E0156AED1CF30DA2310C6A708E088F9C219BC772629100</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CB0000000000E970200008E080556C2D7E030B48E0000</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CA4020C1D87110160A2B6BA12D2EE2171251C30FBC039518E085AAC7E6E9DDD37B600</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CB0000000000E970200008E08F74B2B26F0CDCCE90000</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CA4020C1D8711014C3A0C102647A46613A18E3D5480C1328E08D4A2D7785C00692E00</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CB0000000000E970200008E080C2D48357F0D592D0000</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CA4020C1D8711017EFE5C0C79DE36B538DDF1FFBF25F1488E08680FA5060E8CCD8A00</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CB0000000000E970200008E08D871CCADC9A53AA40000</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CA4020C1D87110137B3389C11D89860CD4CEF705249C38C8E08BE08E0801F8C1E2700</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CB0000000000E970200008E0867726A6E5F4F8E370000</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CA4020C1D871101B07423F80083EDD818123BF8422ED77C8E089508DEF13CBE6D8600</InputAPDU>
</InputAPDUInfo>
<InputAPDUInfo>
<InputAPDU>0CB0000000000E970200008E0800A7E854CC4A6F780000</InputAPDU>
</InputAPDUInfo>
</Transmit>
</soap:Body>
</soap:Envelope>